app/controllers/password_resets_controller.rb

  def create
    @user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "wanderley.eduardo@gmail.com"], ["LIMIT", 1]]

  def update
    @user = User.find_signed!(params[:token], purpose: "password_reset")
    if @user.update(password_params)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$12$ZhlCyH8V/zt0yeyFM0lheui9PE8htEREI4qGZxFX6mQCJx5LKVOGa"], ["updated_at", "2024-05-13 17:51:45.057147"], ["id", 5]]