app/controllers/passwords_controller.rb

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$12$jwsjjynd5f3EGIUlRqHnEu55i0eogmJV/QTIeFOxEyAD62ukct7h2"], ["updated_at", "2024-05-09 17:25:46.559563"], ["id", 2]]
---
  def update
   if Current.user.update(password_params)